Documents/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>Продажи</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НазваниеТура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТуристическиеПрограммы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Город</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧеловек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прибыль</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Туроператор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Туроператоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Продажи/Ext/ManagerModule.bsl
Процедура Печатьдоговора(ТабДок, Ссылка) Экспорт
	Макет = Документы.Продажи.ПолучитьМакет("Макет");
	
	ШапкаОбласть =  Макет.ПолучитьОбласть("Шапка");
	ОстальноеОбласть = Макет.ПолучитьОбласть("Остальное");
	РеквизитыОбласть = Макет.ПолучитьОбласть("РеквизитыСторон");
	
	ТабДок = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Продажи.Сотрудник.Наименование КАК СотрудникНаименование,
	|	Продажи.Клиент.Наименование КАК КлиентНаименование,
	|	Продажи.Клиент.СерияНомерПаспорта КАК КлиентСерияНомерПаспорта,
	|	Продажи.Клиент.КемВыдан КАК КлиентКемВыдан,
	|	Продажи.Клиент.ДатаВыдачи КАК КлиентДатаВыдачи,
	|	Продажи.Клиент.Телефон КАК КлиентТелефон
	|ИЗ
	|	Документ.Продажи КАК Продажи
	|ГДЕ
	|	Продажи.Ссылка = &Ссылка";
	Запрос.Параметры.Вставить("Ссылка", Ссылка[0]);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТабДок.Очистить();
	
	Если Выборка.Следующий() Тогда 
		ШапкаОбласть.Параметры.Турагент = Выборка.СотрудникНаименование;
		ШапкаОбласть.Параметры.ФИОКлиента = Выборка.КлиентНаименование;
		ТабДок.Вывести(ШапкаОбласть);
		
		ТабДок.Вывести(ОстальноеОбласть);
		
		РеквизитыОбласть.Параметры.ФИО = Выборка.КлиентНаименование;
		РеквизитыОбласть.Параметры.Паспорт =  Строка(Выборка.КлиентСерияНомерПаспорта+" "+Выборка.КлиентКемВыдан+" "+Формат(Выборка.КлиентДатаВыдачи,"ДФ=dd.MM.yyyy"));
		РеквизитыОбласть.Параметры.Телефон = Строка(Выборка.КлиентТелефон);
		РеквизитыОбласть.Параметры.ФИОСотрудника = Выборка.СотрудникНаименование;
		ТабДок.Вывести(РеквизитыОбласть);
	КонецЕсли;

КонецПроцедуры
